#include<iostream>
#include<locale>

using namespace std;
int main()
{
	setlocale(LC_ALL, "rus");
	system("color 1F");

	int in, n1 = 0, d1 = 1;
	long long num = 1111, num2, d2 = 0;
	char D = 'n', cn = ' ';


	cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
	cout << "_______________________________________________________________________\n";
	cout << "\t1 - Информация о режимах работы\n\t2 - Шифрование четырехзначных чисел\n";
	cout << "\t3 - Шифрование любых чисел\n\t4 - Дешифратор четырехзначных чисел\n\t5 - Дешифратор любых чисел\n\t6 - Выход\n";
	cout << "_______________________________________________________________________\n";
	cout << "Введите номер необходимой операции: ";
	cin >> in;
	system("cls");
	system("color 0F");




	if (in < 1 || in >6)
	{
		system("cls");
		system("color C0");
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "_______________________________________________________________________\n";
		cout << "\t1 - Информация о режимах работы\n\t2 - Шифрование четырехзначных чисел\n";
		cout << "\t3 - Шифрование любых чисел\n\t4 - Дешифратор четырехзначных чисел\n\t5 - Дешифратор любых чисел\n\t6 - Выход\n";
		cout << "_______________________________________________________________________\n";
		cout << "=======================================================";
		cout << "\n\t\tТАКОЙ ОПЕРАЦИИ НЕТ!!!\n" << endl;
		cout << "=======================================================\n";
		cout << "Введите номер необходимой операции: ";
		cin >> in;
		system("cls");
		system("color 0F");
	}
	else if (in == 1)
	{
		system("cls");
		system("color 1F");
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "=============================================================================" << endl;
		cout << "|\t  2   \t   |  \t    3         | \t4   \t |  \t   5  \t    |" << endl;
		cout << "=============================================================================" << endl;
		cout << "|   Эта операция   |   Эта операция   |   Эта операция   |   Эта операция   |" << endl;
		cout << "|  шифрует только  |  шифрует любые   | дешифрует только | дешифрует любые  |" << endl;
		cout << "|  четырехзначные  | числа, прибавляя |  четырехзначные  |   числа, счерез  |" << endl;
		cout << "|   числа, путем   | к каждой цифре 7 |    числа, через  | алгоритм обратно |" << endl;
		cout << "| прибавления 7777 |   а затем меняя  | алгоритм обратно |    операции 3    |" << endl;
		cout << "| и перестановкрй  |   местами цифры  |    операции 2    |" << "    \t  \t    |" << endl;
		cout << "|   цифр местами   |   как палиндром  | \t\t |" << "                  |" << endl;
		cout << "=============================================================================\n\n" << endl;
		cout << "Введите номер необходимой операции: ";
		cin >> in;
		system("cls");
		system("color 0F");
	}








	if (in == 2)
	{
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "\tОперация 2 - шифрование" << endl;
		cout << "____________________________________________________________________________\n";
		cout << "Введите четырехзначное число: ";
		cin >> num;
		system("cls");
		if (num > 9999 || num < 1000)
		{
			system("cls");
			system("color C0");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 2 - шифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ошибка! Введите четырехзначное чило: ";
			cin >> num;
			system("cls");
			system("color 0F");
		}
		else
		{
			num = num;
		}
		if (num > 999 || num < 10000)
		{
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 2 - шифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ваше четырехзначное число: " << num << endl;
			num = num + 7777;

			(num > 9999) ? num = num % 10000 : num = num;//проверяет пятизначное число или нет и исправляет если надо

			num = ((num / 1000) * 10) + (num / 100 % 10) + ((num / 10 % 10) * 1000) + ((num % 10) * 100);
			cout << "Результат шифрования: " << num << endl;
			cout << "Хотите дешифровать, да или нет(введите y или n): ";
			cin >> D;
			system("cls");
			(D == 'y' || D == 'Y') ? in = 4 : in = 6;
		}

	}




	if (in == 3)
	{
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "\tОперация 3 - шифрование" << endl;
		cout << "____________________________________________________________________________\n";
		cout << "Введите число: ";
		cin >> num;
		num2 = num;
		system("cls");
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "\tОперация 3 - шифрование" << endl;
		cout << "____________________________________________________________________________\n";
		cout << "Ваше  число: " << num2 << endl;
		cout << "Результат шифрования: ";
		while (num != 0) //цикл +7 и для переворота числа 
		{
			n1 = num % 10 + 7;
			if (n1 > 9)
			{
				n1 = n1 % 10;
			}
			num = num / 10;//ядро цикла
			cout << n1;//вывод постепенный результата
		}
		cout << "\nХотите дешифровать, да или нет(введите y или n): ";
		cin >> D;
		system("cls");
		(D == 'y' || D == 'Y') ? in = 5 : in = 6;

	}





	if (in == 4)
	{
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "\tОперация 4 - дешифрование" << endl;
		cout << "____________________________________________________________________________\n";
		cout << "Введите четырехзначное число: " << endl;
		cin >> num;
		system("cls");
		if (num > 9999 || num < 1000)
		{
			system("cls");
			system("color C0");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 4 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ошибка! Введите четырехзначное чило: ";
			cin >> num;
			system("cls");
			system("color 0F");
		}
		else
		{
			num = num;
		}
		if (num > 999 || num < 10000)
		{
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 4 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ваше четырехзначное число: " << num << endl;
			(num < 7777) ? num = ((10000 + ((num / 1000) * 10) + (num / 100 % 10) + ((num / 10 % 10) * 1000) + ((num % 10) * 100)) - 7777) : num = ((((num / 1000) * 10) + (num / 100 % 10) + ((num / 10 % 10) * 1000) + ((num % 10) * 100)) - 7777);

			cout << "Результат дешифрования: " << num << endl;
		}
		in = 6;
		system("pause");
	}






	if (in == 5)
	{
		num = 0;
		cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
		cout << "\tОперация 5 - дешифрование" << endl;
		cout << "____________________________________________________________________________\n";
		cout << "Число которое надо дешифровать начинается с нуля? (y или n): ";
		cin >> D;
		system("cls");
		(D == 'y' || D == 'Y') ? in = 1 : in = 2;
		if (in == 1)
		{
			system("cls");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 5 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Введите цифру 1 и дальше без пробела ваше число как оно есть! : ";
			cin >> num;
			num2 = num;
			system("cls");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 5 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ваше  число: " << num2 << endl;
			cout << "Результат шифрования: ";
			while (num != 0) //цикл -7 и переворот числа
			{
				if (num > 9)
				{
					d1 = num % 10;
					(d1 < 7) ? d1 = (d1 + 10) - 7 : d1 = d1 - 7;
					num = num / 10;
					cout << d1;
				}
				else
				{
					num = 0;
				}

			}
			cout << endl;
			system("pause");
			in = 6;
			system("cls");


		}
		else
		{
			system("cls");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 5 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Введите число : ";
			cin >> num;
			num2 = num;
			system("cls");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\tОперация 5 - дешифрование" << endl;
			cout << "____________________________________________________________________________\n";
			cout << "Ваше  число: " << num2 << endl;
			cout << "Результат шифрования: ";
			while (num != 0) //цикл -7 и переворот числа
			{

				d1 = num % 10;
				(d1 < 7) ? d1 = (d1 + 10) - 7 : d1 = d1 - 7;
				num = num / 10;
				cout << d1;


			}
			cout << endl;
			system("pause");
			in = 6;
			system("cls");
		}
	}







		

		   




		if (in == 6)
		{

			system("cls");
			system("color B0");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\n\tКонец программы!\n";
			cout << "\tВсего вам наилучшего!\n\n";
		}


		if (in < 1 || in >6)
		{
			system("cls");
			system("color 4E");
			cout << "\n====================== ПРОГРАММА ШИФРОВКИ И ДЕШИФРОВКИ ======================\n";
			cout << "\n\n\t\tВы просто не исправимы\n";

			cout << "\n\t\tТАКОЙ ОПЕРАЦИИ НЕТ!!!\n" << endl;
			cout << "\n=======================================================\n";
			system("pause");
		}



		system("pause");
		return 0;
	
}